Autodesk.Revit.UI.ViewSheetSetUIData.Create(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Create an new view sheet set
name:
View sheet set name to be created.
viewIds:
View id(s) to be created with.
Returns:
ElementId is invalid if creates failed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Save(Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Save the changes for the current view sheet set.
elementId:
The view sheet set to be saved.
viewIds:
View id(s) to be saved with.
Returns:
False if Save operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.Rename(Autodesk.Revit.DB.ElementId,System.String)
Rename the current view sheet set.
elementId:
The view sheet set to be renamed.
newName:
View sheet set name to be renamed as.
Returns:
False if Rename operation fails, otherwise True.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.SetInSessionViewIds(System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
Sets the set of in-session views' id.
elementIds:
The in-session view Id set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.UI.ViewSheetSetUIData.GetInSessionViewIds
Gets the set of in-session views's id.
Returns:
The in-session view Id set.